# Используем официальный образ Python как базу
FROM python:3.10-slim

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файл зависимостей и устанавливаем их
# --no-cache-dir для уменьшения размера образа
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальной код приложения в рабочую директорию
COPY . .

# Команда для запуска приложения с Uvicorn
# Предполагая, что ваше приложение запускается из src/main.py (как в main.py)
# 0.0.0.0 позволяет доступ извне контейнера
CMD ["uvicorn", "src.main:app", "--host", "0.0.0.0", "--port", "8000"]

# Если ваше приложение находится в корневой папке (main.py):
# CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]